<?php

use yii\db\Schema;
use yii\db\Migration;

class m160104_080021_create_region_table extends Migration
{
    public function up()
    {
        $this->createTable('region',
            [
                'region_id' => 'pk',
                'name' => 'varchar(50)',
            ]);

        $this->execute("INSERT INTO region() VALUES
    (1, 'АР Крым')
, (2, 'Винницкая область')
, (3, 'Волынская область')
, (4, 'Днепропетровская область')
, (5, 'Донецкая область')
, (6, 'Житомирская область')
, (7, 'Закарпатская область')
, (8, 'Запорожская область')
, (9, 'Ивано-Франковская область')
, (10, 'Киевская область')
, (11, 'Кировоградская область')
, (12, 'Луганская область')
, (13, 'Львовская область')
, (14, 'Николаевская область')
, (15, 'Одесская область')
, (16, 'Полтавская область')
, (17, 'Ровенская область')
, (18, 'Сумская область')
, (19, 'Тернопольская область')
, (20, 'Харьковская область')
, (21, 'Херсонская область')
, (22, 'Хмельницкая область')
, (23, 'Черкасская область')
, (24, 'Черниговская область')
, (25, 'Черновицкая область')");
    }

    public function down()
    {
        $this->dropTable('region');
    }

}
